src/test/resources/payload/IntlPaymentAuthService/AplazoResponse.json

{
	"orderNumber": "0002919021",
	"checkoutLocale": null,
	"cartId": "o730575550070",
	"profileId": "ugp2233800071",
	"siteId": "AEO_MX",
	"paymentHeaders": [
		{
			"paymentHeaderId": "ph258434936",
			"state": "REDIRECT_APLAZO",
			"loanId": 63033,
			"amount": 1474,
			"currencyCode": "MXN",
			"gatewayIndicator": "APLAZO",
			"paymentMethod": "altPay",
			"paymentVariation": "aplazo",
			"submittedDate": "2023-05-24T11:22:57.973586",
			"billingAddress": {
				"firstName": "firstName",
				"lastName": "lastName",
				"address1": "Some Street",
				"address2": "",
				"neighbourhood": "",
				"postalCode": "15234",
				"city": "Mexico City",
				"state": "CMX",
				"country": "MX",
				"phoneNumber": "+526354635689",
				"email": "email@ae.com"
			}
		}
	]
}